{"basics":{"name":"Ahad Chaudhry","label":"Machine Learning Engineer at Microsoft","image":"","email":"ahad.e.chaudhry@gmail.com","phone":"","url":"https://kngofkng.github.io","summary":"Ahad Chaudhry is a Software Engineer at Microsoft with expertise in machine learning, data analytics, and distributed systems. Originally from Pakistan, he earned his computing science degree from Simon Fraser University on full scholarship. His career spans Environment Canada (web applications, ML models), Activision (real-time data pipelines for Call of Duty), and Microsoft, where he personalizes Viva Insights for millions of users across Outlook and Teams. Ahad has implemented cutting-edge Differential Privacy algorithms, improved engagement metrics by 4x through ML optimization, and currently collaborates with Microsoft Research on causal insights for Copilot Analytics. Passionate about global impact and continuous learning.","location":{"address":"","postalCode":"","city":"Redmond","countryCode":"US","region":"Washington"},"profiles":[{"network":"LinkedIn","username":"ahad-chaudhry","url":"https://www.linkedin.com/in/ahad-chaudhry"}]},"work":[{"name":"Microsoft","position":"Machine Learning Engineer 2","url":"","startDate":"2024-02","endDate":"Present","summary":"Redmond, Washington, United States","highlights":["Gave internal talks to 250+ audiences on Causal Inference and Differential Privacy, exceeding average engagement rates by 20%.","Built a generic causal inference pipeline using ensemble-based models, SHAP, and causal forests to determine the causal effect of collaboration and co-pilot metrics on success outcomes, achieving results within 10 percent of A/B testing.","Trained, tuned, and deployed a random forest classifier to predict important features for synthetically generated outcomes to identify top behavior metrics for organizational success."]},{"name":"Microsoft","position":"Software Engineer","url":"","startDate":"2020-09","endDate":"2024-02","summary":"Redmond, Washington, United States","highlights":["Implemented a new Differential Privacy algorithm (Laplace with Discretization and Rounding) to improve accuracy and safeguard privacy in managerial reports.","Led efforts to identify and resolve critical Differential Privacy issues (e.g., rounding noise in Spark and Azure Analysis Services code) to enhance system accuracy for small metrics.","Established expertise in Differential Privacy-related code, driving collaboration with MSR and Data Science to improve privacy implementation and workflows.","Delivered successful results from a Differential Privacy experiment on the Offline Data Analysis Platform, streamlining workflows and shortening feedback loops to enhance developer efficiency through the Detonation Chamber.","Retrained and deployed a model that doubled click-through rates (CTR) and increased organizer CTR by 4x in experiments, significantly boosting user engagement.","Spearheaded development and deployment of two versions of the Meeting Preparation Recommendation Model, driving improvements in user engagement metrics across both iterations.","Reduced the frequency of calls to the Azure Personalizer Service from daily to weekly, optimizing system performance and reducing resource consumption.","Developed a robust analysis pipeline for the Plan Your Time Away feature, contributing to a key publication on the feature's impact on user behavior.","Conducted in-depth analyses on Virtual Commute and No-Meeting Day workflows, delivering actionable insights that informed product feature improvements.","Built a measurable framework to assess the well-being and productivity impact of the Focus Time feature, providing key insights for product development."]},{"name":"Activision","position":"Data Engineer","url":"","startDate":"2019-05","endDate":"2019-12","summary":"Vancouver, Canada Area","highlights":["Collaborated on a team to deliver a real-time data pipeline that ingests data from 4 million concurrent users playing Call Of Duty Mobile and Call of Duty Modern Warfare in seconds.","Implemented and optimized numerous production-grade Java and Python micro-services running on AWS capable of ingesting petabytes of data daily.","Designed horizontally scalable systems utilizing open-source tools like Docker, Kafka, Hive, Spark, and ELK stack.","Contributed ideas for improving developer experience to enrich team productivity and workflows."]},{"name":"Environment and Climate Change Canada","position":"Environmental Data Scientist","url":"","startDate":"2018-05","endDate":"2019-04","summary":"401 Burrard St, Vancouver","highlights":["Rewrote and optimized Python/Perl scripts to utilize the latest data science packages, resulting in over 800 times performance increase in the department's ingest process.","Developed an ASP.NET MVC application in C#, HTML, CSS, and Javascript (jQuery) to wrap newly developed Python scripts in an accessible interface for non-technical employees.","Consulted with co-workers and developed an ASP.NET MVC web application providing an interface for viewing and editing database tables with automatic logging, bulk operations, and advanced search.","Developed and assessed machine learning models for time series forecasting, regression, and classification that significantly expedited the team's data validation workflow."]},{"name":"CJSF Radio, 90.1FM","position":"Software Developer","url":"","startDate":"2018-01","endDate":"2018-05","summary":"TC 216, Simon Fraser University, Burnaby, BC","highlights":["Contributed to weekly SCRUM meetings to develop plans for new application and website functionality.","Enhanced knowledge of JAVA and object-oriented programming by maintaining and implementing new features for CJSF's Android application.","Assisted in the implementation of a RESTful API designed to connect smartphone applications to the website's database."]}],"volunteer":[],"education":[{"institution":"Simon Fraser University","location":"Burnaby, BC, Canada","url":"","area":"Computer Science","studyType":"Bachelor\'s degree","startDate":"2015","endDate":"2020","score":"","courses":[]}],"awards":[{"title":"Dean's Honour Roll Spring 2020","date":"2020","awarder":"Simon Fraser University","url":"","summary":""}],"certificates":[{"name":"Triplebyte Certified Machine Learning Engineer","date":"","issuer":"Triplebyte","url":"","icon":""},{"name":"C# Essential Training: 1 Syntax and Object Oriented Programming","date":"","issuer":"","url":"","icon":""},{"name":"Learning Azure DevOps","date":"","issuer":"","url":"","icon":""},{"name":"C# Essential Training: 2 Flow Control, Arrays, and Exception Handling","date":"","issuer":"","url":"","icon":""},{"name":"Learning PowerShell","date":"","issuer":"","url":"","icon":""}],"publications":[],"skills":[{"name":"Machine Learning","level":"","icon":"","keywords":["Differential Privacy","Azure ML","Scikit-Learn"]}],"languages":[{"language":"Urdu","fluency":"Native or Bilingual","icon":""},{"language":"Hindi","fluency":"Full Professional","icon":""},{"language":"Punjabi","fluency":"Professional Working","icon":""}],"interests":[],"references":[],"projects":[]}